meeting/minutes/2026/01-27.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 150 Minutes 2026-01-27</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 150 Minutes 2026-01-27</h1>
<p>
<a href="../">Meeting index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#minutes">Draft Minutes</a></li>
<li><a href="#new-actions">Summary of new and continuing actions <code>[0/5]</code></a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[9/11]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#approve-minutes">1.3. Approve minutes of the previous meeting</a></li>
<li><a href="#next-meeting">1.4. Next meeting</a></li>
<li><a href="#open-actions">1.5. Review of open action items <code>[2/5]</code></a></li>
<li><a href="#open-pull-requests">1.6. Review of open pull requests and issues</a>
<ul>
<li><a href="#merge-without-discussion">1.6.1. Merge without discussion</a></li>
<li><a href="#close-without-action">1.6.2. Close without action</a></li>
<li><a href="#substantive">1.6.3. Substantive PRs</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#technical-agenda">2. Technical agenda</a>
<ul>
<li><a href="#pr-2394">2.1. PR #2394: 2361 Use upper case for encoding names; comparisons are case-blind</a></li>
<li><a href="#pr-2362">2.2. PR #2362: 2355 bin:infer-encoding: further alignments</a></li>
<li><a href="#pr-2350">2.3. PR #2350 / #2247: Generators: any progress to report?</a></li>
<li><a href="#pr-2019">2.4. PR #2019: 1776: XSLT template rules for maps and array</a></li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a>
<ul>
<li><a href="#h-7AB4E5D4-B0D5-4AB1-B2EF-E2CA108947C3">3.1. Where are we and where are we going?</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Draft Minutes</h2>
<div class="outline-text-2" id="text-minutes">
</div>
</div>
<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[0/5]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-143-03: JK to look for C14N test suites.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-144-01: MK to consider if any now lost value comparisons should be added as examples.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-148-02: NW to publish a dated draft after QT4CG-148-01 is complete.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-149-01: CG to draft a new PR with the common rule note.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-149-02: MK to update the PR #2372 so that the “?” are part of the comment.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-01: NW to ask Jirka for a room at XML Prague for Tuesday/Wednesday</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-02: <b>Everyone</b> review the “nice to have” tags and object where they wish</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-03: NW to setup an agenda item to review open issues</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-04: NW to see about a status update on that PR; possibly schedule discussion</li>
</ul>
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[9/11]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<p>
Regrets: JWL.
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> David J Birnbaum (DB)</li>
<li class="off"><code>[&#xa0;]</code> Reece Dunn (RD)</li>
<li class="on"><code>[X]</code> Christian Grün (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK)</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="on"><code>[X]</code> Juri Leino (JLO)</li>
<li class="off"><code>[&#xa0;]</code> John Lumley (JWL)</li>
<li class="on"><code>[X]</code> Dimitre Novatchev [-x:20]</li>
<li class="on"><code>[X]</code> Alan Painter (AP</li>
<li class="on"><code>[X]</code> Wendell Piez (WP)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW) <i>Scribe</i>. <i>Chair</i>.</li>
</ul>
</div>
</div>
<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Proposal: Accept <a href="../../agenda/2026/01-27.html">the agenda</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept <a href="../../minutes/2026/01-20.html">the minutes of the previous meeting</a>. 
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
The next meeting is planned for 3 February 2026.
</p>

<p>
No regrets heard.
</p>
</div>
</div>
<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[2/5]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-143-03: JK to look for C14N test suites.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-144-01: MK to consider if any now lost value comparisons should be added as examples.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-148-02: NW to publish a dated draft after QT4CG-148-01 is complete.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-149-01: CG to draft a new PR with the common rule note.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-149-02: MK to update the PR #2372 so that the “?” are part of the comment.</li>
</ul>

<p>
JK would like review of the samples in his PR. MK to try.
</p>
</div>
</div>
<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>
<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.1.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2392">#2392</a>: 2384 Clarify that fn:xsd-validator can validate attributes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2391">#2391</a>: 2378 HTML indenting: clarify the definition of inline elements</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2363">#2363</a>: 2349 Revert array:join</li>
</ul>

<p>
Proposal: Merge without discussion.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.2.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2360">#2360</a>: fn:root() vs. absolute path expressions</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2354">#2354</a>: `fn:append`</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2351">#2351</a>: Current Drafts: What will we keep, what may be dropped?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2159">#2159</a>: JNodes: Learning from JSONiq?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2127">#2127</a>: JNodes: Include atomic items</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1944">#1944</a>: Try/Catch/Finally - order of evaluation</li>
</ul>

<p>
Proposal: Close with no further action.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.3.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2394">#2394</a>: 2361 Use upper case for encoding names; comparisons are case-blind</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2362">#2362</a>: 2355 bin:infer-encoding: further alignments</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2350">#2350</a>: 708 An alternative proposal for generators</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2247">#2247</a>: 716 Deferred Evaluation in XPath - the f:generator record</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>
<div id="outline-container-pr-2394" class="outline-3">
<h3 id="pr-2394"><span class="section-number-3">2.1.</span> PR #2394: 2361 Use upper case for encoding names; comparisons are case-blind</h3>
<div class="outline-text-3" id="text-pr-2394">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2394">#2394</a>.
</p>

<p>
MK introduces the PR.
</p>

<ul class="org-ul">
<li>MK: We’ve always believed that encodings are case blind, it’s a matter of
saying it in the right places.
<ul class="org-ul">
<li>… It runs across specs a fair bit.</li>
</ul></li>
<li>MK: In F&amp;O: a note that encoding names are compared without regard to case.</li>
<li>MK: Most of the other changes are to use upper case in examples and things.</li>

<li>JLO: The minus sign is now mandatory?</li>
<li>MK: We say that “UTF-8” has to be accepted, we don’t say that “UTF8” without
the hyphen should be rejected.
<ul class="org-ul">
<li>… In practice, if you go down to Java or C# to get your encoding technology,
it’ll accept both.</li>
</ul></li>
<li>JLO: Would it be interesting to have those encodings as a symbol or a QName so
that we can reuse them?</li>
<li>MK: I’m not sure how one would do that. We could have a data type.</li>
<li>JLO: An enum?</li>
<li>MK: We don’t have a way of defining an open enum.</li>
<li>CG: I guess this PR will cause with conflicts with the next one.</li>
</ul>

<p>
We’ll just have to work it out.
</p>

<p>
Proposal: Accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2362" class="outline-3">
<h3 id="pr-2362"><span class="section-number-3">2.2.</span> PR #2362: 2355 bin:infer-encoding: further alignments</h3>
<div class="outline-text-3" id="text-pr-2362">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2362">#2362</a>.
</p>

<ul class="org-ul">
<li>CG: This was caused by some observations by MK that the error handling wasn’t clear.
<ul class="org-ul">
<li>… I found other edge cases, so I decided to try to handle them like unparsed
text.</li>
<li>… I think we should change the F&amp;O spec to refer to these rules.</li>
</ul></li>
<li>CG: One note: <code>fn:unparsed-text</code> doesn’t only look at the bytes; it looks at
external encodings and media types.
<ul class="org-ul">
<li>… I implemented both variants and it seemed like alignment would be better.</li>
</ul></li>
</ul>

<p>
Proposal: Accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2350" class="outline-3">
<h3 id="pr-2350"><span class="section-number-3">2.3.</span> PR #2350 / #2247: Generators: any progress to report?</h3>
<div class="outline-text-3" id="text-pr-2350">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2350">#2350</a> and <a href="https://qt4cg.org/dashboard/#pr-2247">#2247</a>.
</p>

<ul class="org-ul">
<li>MK: I think we need to stand back from the detail and think about what our
strategy is here.
<ul class="org-ul">
<li>… It probably makes sense to do that in the larger context of the whole project.</li>
<li>… What’s the balance between finishing and doing more.</li>
</ul></li>
<li>DN: I have a good summary of what has been done.
<ul class="org-ul">
<li>… (DN shares his screen)</li>
<li>… <a href="https://github.com/qt4cg/qtspecs/pull/2247#issuecomment-3774369494">DN’s comment on the PR</a>, and following comments</li>
</ul></li>
<li>DN: Generator record proposal introduces a first-class abstraction for generators.
<ul class="org-ul">
<li>… We don’t depend on implementation-dependent magic</li>
<li>… Guaranteed that our code is portable across any XPath 4 compliant implementation</li>
<li>… We are ready to proceed</li>
</ul></li>
</ul>

<p>
Come back to do detailed review. 
</p>

<ul class="org-ul">
<li>MK: I think that there’s on the order of forty-two hours of work just in reviewing it.</li>
</ul>
</div>
</div>
<div id="outline-container-pr-2019" class="outline-3">
<h3 id="pr-2019"><span class="section-number-3">2.4.</span> PR #2019: 1776: XSLT template rules for maps and array</h3>
<div class="outline-text-3" id="text-pr-2019">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>.
</p>

<p>
Not ready for discussion.
</p>

<ul class="org-ul">
<li>MK: I’m long overdue on revising this proposal.
<ul class="org-ul">
<li>… I think this is the biggest outstanding “must do” items.</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
<div id="outline-container-h-7AB4E5D4-B0D5-4AB1-B2EF-E2CA108947C3" class="outline-3">
<h3 id="h-7AB4E5D4-B0D5-4AB1-B2EF-E2CA108947C3"><span class="section-number-3">3.1.</span> Where are we and where are we going?</h3>
<div class="outline-text-3" id="text-h-7AB4E5D4-B0D5-4AB1-B2EF-E2CA108947C3">
<ul class="org-ul">
<li>NW: Any interest in a face-to-face meeting in Prague?</li>
</ul>

<p>
Some interest.
</p>

<p>
ACTION QT4CG-150-01: NW to ask Jirka for a room at XML Prague for Tuesday/Wednesday
</p>

<ul class="org-ul">
<li>MK: I’ve gone through the issues list and tagged some as “nice-to-have”.
<ul class="org-ul">
<li>… We have to draw a line and we’d still have a conherent spec without those things.</li>
</ul></li>

<li>NW: You sound determined to move to the end game and get finished.</li>

<li>MK: I’d like to finish this in 2027 and if we’re going to achieve that, we
need to start closing down options.</li>
</ul>

<p>
Some discussion of EXPath specs; we’re doing File and Binary, but others that
happen could be done on a different schedule.
</p>

<ul class="org-ul">
<li>WP: I think it’s important to work out how big these buckets are.</li>
</ul>

<p>
Some discussion of nice-to-have features.
</p>

<ul class="org-ul">
<li>MK: My feeling is that if we have a coherent proposal with test cases that we
can accept, then we can take it. But if we don’t, then it doesn’t hold up the
work.</li>
</ul>

<p>
ACTION QT4CG-150-02: Everyone review the “nice to have” tags and object where they wish
</p>

<p>
ACTION QT4CG-150-03: NW to setup an agenda item to review open issues
</p>

<ul class="org-ul">
<li>MK: Where are we on publishing a stable draft?</li>

<li>NW: I’m hoping to do that this week.</li>

<li>MK: What are we going to do about cleaning them up and fixing the status sections.</li>

<li>NW: My plan is to simply add a note to each status section saying that it’s
stable. If we wanted to clean up all the dangling references and such, write proper status
sections, etc. I think that’s a month’s work. I’d rather not wait that long.</li>

<li>MK: Okay.</li>

<li>CG: what about <a href="https://github.com/qt4cg/qtspecs/pull/2345">RUVs proposal</a>?</li>

<li>MK: I’m torn on that one because of the parser implications.</li>

<li>NW: Yes, I’ve been leaving that one blocked on the assumption that unbounded
lookahead is a non-starter.</li>
</ul>

<p>
ACTION QT4CG-150-04: NW to see about a status update on that PR; possibly schedule discussion
</p>

<p>
NW also observes that there are some unresolved questions about what form our
final documents can take vis-a-vis W3C policies about Community Groups and
Working Groups.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
